In [1]:
import pandas as pd
import datetime

### Scraping US inflation rate monthly

In [2]:
inflation_rates_us = pd.read_html('https://www.rateinflation.com/inflation-rate/usa-historical-inflation-rate/')[0]

In [3]:
inflation_rates_us.head(3)

,Year,jan,feb,mar,apr,may,jun,jul,aug,sep,oct,nov,dec,Annual
0,2023,6.410%,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,2022,7.480%,7.871%,8.542%,8.259%,8.582%,9.060%,8.525%,8.263%,8.202%,7.745%,7.110%,6.454%,8.003%
2,2021,1.400%,1.676%,2.620%,4.160%,4.993%,5.391%,5.365%,5.251%,5.390%,6.222%,6.809%,7.036%,4.698%

In [4]:
inflation_rates_us = pd.melt(inflation_rates_us, id_vars="Year", value_vars=[i for i in inflation_rates_us if i != "Annual" ])

In [5]:
inflation_rates_us.value = inflation_rates_us.value.str.replace("%", "")

In [6]:
inflation_rates_us.rename(columns={"Year":"year", "variable": "month", "value": "inflation_rate"}, inplace=True)

In [7]:
inflation_rates_us.inflation_rate = inflation_rates_us.inflation_rate.astype("float16")

In [8]:
inflation_rates_us.month = inflation_rates_us.month.apply(lambda x: datetime.datetime.strptime(x, "%b").month)

In [9]:
inflation_rates_us.sort_values(by=["year", "month"], inplace=True)

In [10]:
inflation_rates_us.dropna(subset=["inflation_rate"], inplace=True)

In [11]:
inflation_rates_us.reset_index(inplace=True, drop=True)

In [12]:
inflation_rates_us.head()

   year  month  inflation_rate
0  1914      1        2.041016
1  1914      2        1.019531
2  1914      3        1.019531
3  1914      4        0.000000
4  1914      5        2.062500

In [13]:
inflation_rates_us.to_csv("src/monthly/inflation_rates/us_inflation_rate_monthly.csv", index=False)

### Scraping Euro Zone inflation rate monthly

In [14]:
inflation_rates_eu = pd.read_html('https://www.rateinflation.com/inflation-rate/euro-area-historical-inflation-rate/')[0]

In [15]:
inflation_rates_eu.head(3)

,Year,jan,feb,mar,apr,may,jun,jul,aug,sep,oct,nov,dec,Annual
0,2023,8.64%,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,2022,5.11%,5.87%,7.44%,7.44%,8.05%,8.64%,8.87%,9.14%,9.93%,10.62%,10.05%,9.20%,8.38%
2,2021,0.91%,0.94%,1.33%,1.62%,1.98%,1.90%,2.16%,2.96%,3.36%,4.05%,4.87%,4.96%,2.59%

In [16]:
inflation_rates_eu = pd.melt(inflation_rates_eu, id_vars="Year", value_vars=[i for i in inflation_rates_eu if i != "Annual" ])

In [17]:
inflation_rates_eu.value = inflation_rates_eu.value.str.replace("%", "")

In [18]:
inflation_rates_eu.rename(columns={"Year":"year", "variable": "month", "value": "inflation_rate"}, inplace=True)

In [19]:
inflation_rates_eu.inflation_rate = inflation_rates_eu.inflation_rate.astype("float16")

In [20]:
inflation_rates_eu.month = inflation_rates_eu.month.apply(lambda x: datetime.datetime.strptime(x, "%b").month)

In [21]:
inflation_rates_eu.sort_values(by=["year", "month"], inplace=True)

In [22]:
inflation_rates_eu.dropna(subset=["inflation_rate"], inplace=True)

In [23]:
inflation_rates_eu.reset_index(inplace=True, drop=True)

In [24]:
inflation_rates_eu.head()

   year  month  inflation_rate
0  1997      1        2.050781
1  1997      2        1.820312
2  1997      3        1.540039
3  1997      4        1.320312
4  1997      5        1.360352

In [25]:
inflation_rates_eu.to_csv("src/monthly/inflation_rates/eu_inflation_rate_monthly.csv", index=False)